#+STARTUP: showall
#+STARTUP: lognotestate
#+TAGS: research(r) uvic(u) today(y) todo(t) cooking(c)
#+SEQ_TODO: TODO(t) STARTED(s) DEFERRED(r) CANCELLED(c) | WAITING(w) DELEGATED(d) APPT(a) DONE(d)
#+DRAWERS: HIDDEN STATE
#+ARCHIVE: %s_done::
#+TITLE: 
#+CATEGORY: 
#+PROPERTY: header-args:sql             :engine postgresql  :exports both :cmdline csc370
#+PROPERTY: header-args:sqlite          :db /path/to/db  :colnames yes
#+PROPERTY: header-args:C++             :results output :flags -std=c++17 -Wall --pedantic -Werror
#+PROPERTY: header-args:R               :results output  :colnames yes
#+OPTIONS: ^:nil




* ON update

- What if a student field referenced in Enrolled is updated in the relations Students?

- 2 options
   - *CASCADE*: 
      if student sid is changed Students, update it in Enrolled

   - *RESTRICT*:
      if student sid exists in Enrolled, do not allow the update

#+begin_src sql
CREATE TABLE Enrolled(
    sid TEXT,
    cid TEXT,
    grade int,
    PRIMARY KEY (sid, cid),
    FOREIGN KEY (sid) REFERENCES Students
      ON DELETE RESTRICT
      ON UPDATE CASCADE,
    FOREIGN KEY (cid) REFERENCES Courses
);
#+end_src

#+RESULTS:
|   |

#+begin_src sql
delete from enrolled;
delete from courses;
delete from students;
insert into courses (cid, cname) values ('csc370', 'databases');
insert into students (sid, sname) values ('s001', 'Sean Connery');
insert into enrolled(sid, cid) values ('s001', 'csc370');
#+end_src

#+RESULTS:
| DELETE 0   |
|------------|
| DELETE 1   |
| DELETE 0   |
| INSERT 0 1 |
| INSERT 0 1 |
| INSERT 0 1 |

Now we change students!!! (not enrolled)

#+begin_src sql
update students set sid = 's007' where sid = 's001';
#+end_src

But Enrolled *ALSO* changed:

#+begin_src sql
select * from enrolled;
#+end_src

#+RESULTS:
| sid  | cid    | grade |
|------+--------+-------|
| s007 | csc370 |       |


We can't delete student because we defined it as RESTRICT. 

#+begin_src sql
delete from students where sid = 's007'; -- this will fail
#+end_src

Note that once a relation references another on in a foreign key constraint, we can't drop it:

#+begin_src sql
DROP TABLE IF EXISTS Students; -- this will fail
#+end_src

We need to drop Enrolled first (or remove the constraint... more on that later)

* DEFAULT values for an attribute

At insertion, when non specified, attributes are set to NULL

Assume R(a,b,c)
  
#+begin_src sql
  INSERT INTO R(b,c) VALUES (1,3), (2,4);
  #+end_src

inserts the tuples (NULL, 1, 3) and (NULL, 2, 4)

We can change this behaviour:

#+begin_src sql
CREATE TABLE R(
   a int DEFAULT 1,
   b int DEFAULT 2,
   c int PRIMARY KEY
);
insert into R(c) values (1),(2),(3); 
insert into R(a,c) values (-1, -2);
insert into R(a,b,c) values (0, 0, 0);
#+end_src

#+begin_src sql
select * from R
#+end_src

#+RESULTS:
|  a | b |  c |
|----+---+----|
|  1 | 2 |  1 |
|  1 | 2 |  2 |
|  1 | 2 |  3 |
| -1 | 2 | -2 |
|  0 | 0 |  0 |




* other


#+begin_src sql
DROP TABLE IF exists courses;
CREATE TABLE Courses(
    cid TEXT PRIMARY KEY ,
    cname TEXT
);
#+end_src

#+RESULTS:
| DROP TABLE   |
|--------------|
| CREATE TABLE |
